src/DataProcessors/Демо_КОД_Обработчик_СвязаннаяРегистрацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>Демо_КОД_Обработчик_СвязаннаяРегистрацияТоваров</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Documents/Демо_Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Демо_Заказ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Демо_КОД_СкладыХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Демо_КОД_Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/Демо_КОД_Обработчик_СвязаннаяРегистрацияТоваров/Ext/ObjectModule.bsl
#Область ОписаниеПеременных

Перем СледующийОбработчик;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает сведения о внешней обработке для регистрации в подсистеме
// дополнительных отчетов и обработок.
//
// Возвращаемое значение:
//  Структура - параметры регистрации внешней обработки.
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	//ПараметрыРегистрации =
	//	ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(
	//		СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
	//
	//ПараметрыРегистрации.Вид =
	//	ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	//ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	//ПараметрыРегистрации.Версия = "1.0";
	//
	//Возврат ПараметрыРегистрации;
	
КонецФункции

// Устанавливает следующий обработчик цепочки или возвращает ранее установленный.
//
// Параметры:
//  Обработчик - ОбработкаОбъект, Неопределено - следующий обработчик цепочки.
//
// Возвращаемое значение:
//  ОбработкаОбъект, Неопределено - следующий обработчик цепочки.
Функция Следующий(Обработчик = Неопределено) Экспорт
	
	Если Обработчик <> Неопределено Тогда
		СледующийОбработчик = Обработчик;
	КонецЕсли;
	
	Возврат СледующийОбработчик;
	
КонецФункции

// Получает товары из заказов, прошедших маршрутизацию, и добавляет их
// в общую очередь связанной регистрации.
//
// Параметры:
//  Контекст - ФиксированнаяСтруктура - контекст выполнения конвейера.
//  Вход - Произвольный - результат предыдущего обработчика.
Процедура Обработать(Контекст, Вход = Неопределено) Экспорт
	
	МассивСвязанныхСсылок = ПолучитьСвязанныеСсылки(Контекст);
	
	Если МассивСвязанныхСсылок.Количество() > 0 Тогда
		КодыУзлов = ПолучитьКодыУзловРезультатаМаршрутизации(Контекст);
		КОД_ДиспетчерРегистрацииКОбмену.ДобавитьЗаданиеРегистрации(
			Контекст.Данные.КонтекстРегистрации,
			Метаданные.Справочники.Демо_КОД_Товары,
			МассивСвязанныхСсылок,
			КодыУзлов);
	КонецЕсли;
	
	ПередатьДругому(Контекст, Вход);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает товары из заказов, прошедших фильтрацию и маршрутизацию.
//
// Параметры:
//  Контекст - ФиксированнаяСтруктура - контекст выполнения конвейера.
//
// Возвращаемое значение:
//  Массив - ссылки связанных товаров.
Функция ПолучитьСвязанныеСсылки(Контекст)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Контекст.Выполнение.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.Товар КАК Ссылка
		|ИЗ
		|	ВТ_СсылкиПоУзлам КАК Маршруты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Демо_Заказ.Товары КАК Товары
		|		ПО Маршруты.Ссылка = Товары.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("Ссылка");
	
КонецФункции


// Возвращает коды узлов, реально полученные маршрутизацией исходных объектов.
Функция ПолучитьКодыУзловРезультатаМаршрутизации(Контекст)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Контекст.Выполнение.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Маршруты.Узел.Код КАК КодУзла
		|ИЗ
		|	ВТ_СсылкиПоУзлам КАК Маршруты";
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса.ВыгрузитьКолонку("КодУзла");
КонецФункции

// Передает управление следующему обработчику цепочки.
//
// Параметры:
//  Контекст - ФиксированнаяСтруктура - контекст выполнения конвейера.
//  Выход - Произвольный - результат текущего обработчика.
Процедура ПередатьДругому(Контекст, Выход = Неопределено)
		
	Если СледующийОбработчик = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СледующийОбработчик.Обработать(Контекст, Выход);
	
КонецПроцедуры

#КонецОбласти
